(function () {
    'use strict';
    /*זהו דף שבו נגדיר את כל המודולים במערכת
     * החשיבות של חלוקת מודלים היא בשביל ביצועים טובים יותר
     * (performance/Best practice)
     * חשוב להבין ש:
     * לא חובה להגדיר כמה מודלים , אפשר להגדיר את כל דפי הכונטרולרים + סרביבסים וכדומה  באותו מודל
     */

    /*
     * סימון יצירת מודול
     * הוא כזה:
     * angular.module('photoApp', [])
     * כלומר שליחת שתי פרמטרים לפונקציה 
     * module
     * הפרמטר הראשון הוא שם המודול אותו אנחנו רוצים להגדיר
     * והשני הוא מערך שבו אנחנו רושמים את כל המודלים התלויים בו 
     * (אפשר להסתכל על זה כusing)
     * אם אין לנו מודולים תלויים פשוט מסמנים מערך ריק
     * 
     * סימון קבלת מודול
     * (get)
     * angular.module('photoApp')
     * כלומר שליחת פרמטר אחד , עם השם של המודול שאנחנו רוצים
     * אם נקרא למודול שלא קיים במערכת תהיה 
     * error
     */

    /*
     * photoApp 
     * הוא המודל המרכזי במערכת שאותו הגדרנו בדף ה
     * html 
     * תחתיו אנחנו מגדירים את כל המודולים שהוא משתמש/תלוי 
     * (dependencies)
     */

    /*
     * חשוב להבין שיש חשיבות לשם המודול
     * הגדרתי אותו בשם זה כי
     * האפליקציה שלנו היא אפליקצית תמונות
     * לכן נתתי שם ראשון שיאפיין את הרעיון המרכזי של האפליקציה ויהיה ייחודי
     perfix-App
     * והשני הוא כי זה מודול ורצוי לכל שם של משהו לסיים אותו עם הסוג שלו
     * למשל מודול בApp
     * וכונטרולר בCtrl
     * וכדומה
     */

    angular.module('photoApp', [
        // Angular modules 
        'ngRoute',

        // Custom modules 
        'photoApp.login',
        'photoApp.photo',

        // common moduels
        'photoApp.service',
        'photoApp.directives'

    ])
      /*
       * סדר הפעולה של אנגולר היא כזה(את הפעולות 1-4 היא עושה רק פעם אחת):
       * 1. דבר ראשון אנגולר אוספת את כל המודולס במערכת למערך של מודולס
       * 2. שנית היא עורכת לכל מודל את המודלים שהיא תלויה בהם (הפרמטר השני שאנחנו שולחים ביצירה) 
       * 3. היא מריצה את הפונקצית הקונפיג שיצרנו עבור כל מודול (אם יצרנו ) הפונקציה הזו:
       * config()
       * 4. היא מריצה את ה run
       * 5. היא מריצה את הקונטרולר שהטענו לדף. 
       * לא את כל הכונרולרים!
       * 6. את הסרביסים היא לא מטעינה מייד אלא בצורה כזו שנקרא בעברית "איתחול איטי"  ובאנגלית:
       * lazy initiation 
       * שזה אומר שאם בקשתי סרביס היא בודקת אם הוא קיים ואם לא היא יוצרת את הסרביס 
       * ומוסיפה למערך של הסרביבים שלה
       * אם הוא קיים המשתנה שהגדרתי רק יצביע לסרביס הקיים
       * זה אומר שהסרביסים הם אוביקטים גלובליים 
       * ומוכרים בכל המערכת
       */
    .run(['$rootScope', '$filter', function ($rootScope, $filter) {
        /*
         * $rootScope
         * הוא הסקופ הראשי במערכת אפשר לקרא לו מכל קונטרולר
         */
        $rootScope.title = "גלרית תמנות";
        /*
         * $filter 
         * הוא סרביס שתפקידו לפלטר את המשתנים באנגולר
         * לתצוגה שאנחנו מעונינים בה
         * זו דוגמה לפילטר של אנגולר
         * date
         */
        $rootScope.currentDate = $filter('date')(new Date(), 'dd/MM/yyyy');
    }]);


    angular.module('photoApp.login', []);
    angular.module('photoApp.photo', []);

    angular.module('photoApp.service', []);
    angular.module('photoApp.directives',[]);
})();